Project/Toir/src/InformationRegisters/торо_СоответствияТеговАСУТПОбъектамТОИР/торо_СоответствияТеговАСУТПОбъектамТОИР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СоответствияТеговАСУТПОбъектамТОИР</name>
  <resources>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ТипСигнала</name>
    <type>
      <types>EnumRef.торо_ТипыСигналовАСУТП</types>
    </type>
  </resources>
  <resources>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ПараметрНаработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </resources>
  <resources>
    <name>Отключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаПростоя</name>
    <type>
      <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    </type>
  </resources>
  <resources>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
    </type>
  </resources>
  <resources>
    <name>ПоказательKPI</name>
    <type>
      <types>CatalogRef.торо_ПоказателиKPI</types>
    </type>
  </resources>
  <dimensions>
    <name>НаименованиеОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Тег</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Подключение</name>
    <type>
      <types>CatalogRef.торо_ПодключенияКБазеДанных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ТипыСигналовАСУТП/торо_ТипыСигналовАСУТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипыСигналовАСУТП</name>
  <enumValues>
    <name>Состояние</name>
  </enumValues>
  <enumValues>
    <name>Показатель</name>
  </enumValues>
  <enumValues>
    <name>Наработка</name>
  </enumValues>
  <enumValues>
    <name>Дефект</name>
  </enumValues>
  <enumValues>
    <name>KPI</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/торо_НаправленияОбъектовРемонтныхРабот/торо_НаправленияОбъектовРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_НаправленияОбъектовРемонтныхРабот</name>
  <predefined>
    <items>
      <name>БезНаправления</name>
      <description>Без направления</description>
    </items>
  </predefined>
  <attributes>
    <name>НаборСвойствОР</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Составное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Служба</name>
    <type>
      <types>EnumRef.гкс_Службы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Направление</name>
      <type>
        <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/торо_СоответствияТеговАСУТПОбъектамТОИР/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекСтраницу();
	УстановитьОтборПоказателейПоОбъектуРемонта();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектРемонтаПриИзменении(Элемент)
	
	УстановитьОтборПоказателейПоОбъектуРемонта();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСигналаПриИзменении(Элемент)
	УстановитьТекСтраницу();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборПоказателейПоОбъектуРемонта()
	
	Если ЗначениеЗаполнено(Запись.ОбъектРемонта) Тогда
		масВыбора = УстановитьСписокПоказателейДляВыбора(Запись.ОбъектРемонта);
	
		ПараметрыВыбора = Новый Массив;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(масВыбора)));
		Элементы.Показатель.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		
		масВыбора = УстановитьСписокПараметровНаработкиДляВыбора(Запись.ОбъектРемонта);
		
		ПараметрыВыбора = Новый Массив;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(масВыбора)));
		Элементы.ПараметрНаработки.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		
		масВыбора = УстановитьСписокТиповыхДефектовДляВыбора(Запись.ОбъектРемонта);
		
		ПараметрыВыбора = Новый Массив;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(масВыбора)));
		Элементы.ВидДефекта.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		Элементы.ВидДефекта1.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	Иначе
		масВыбора = новый Массив;
		
		ПараметрыВыбора = Новый Массив;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(масВыбора)));
		
		Элементы.Показатель.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		Элементы.ПараметрНаработки.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		Элементы.ВидДефекта.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		Элементы.ВидДефекта1.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекСтраницу()
	
	Если Запись.ТипСигнала = ПредопределенноеЗначение("Перечисление.торо_ТипыСигналовАСУТП.Показатель") Тогда
		Элементы.Настройки.ТекущаяСтраница = Элементы.стрПоказатель;
	ИначеЕсли Запись.ТипСигнала = ПредопределенноеЗначение("Перечисление.торо_ТипыСигналовАСУТП.Состояние") Тогда
		Элементы.Настройки.ТекущаяСтраница = Элементы.стрСостояние;
	ИначеЕсли Запись.ТипСигнала = ПредопределенноеЗначение("Перечисление.торо_ТипыСигналовАСУТП.Наработка") Тогда
		Элементы.Настройки.ТекущаяСтраница = Элементы.стрНаработка;
	ИначеЕсли Запись.ТипСигнала = ПредопределенноеЗначение("Перечисление.торо_ТипыСигналовАСУТП.Дефект") Тогда
		Элементы.Настройки.ТекущаяСтраница = Элементы.стрДефект;
	ИначеЕсли Запись.ТипСигнала = ПредопределенноеЗначение("Перечисление.торо_ТипыСигналовАСУТП.KPI") Тогда
		Элементы.Настройки.ТекущаяСтраница = Элементы.стрКПИ;
	Иначе
		Элементы.Настройки.ТекущаяСтраница = Элементы.стрПустая;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьСписокПоказателейДляВыбора(ОбъектРемонта)
	
	масВыбора = Новый Массив;
	
	Если ЗначениеЗаполнено(ОбъектРемонта) Тогда 
		
		ТиповойОР = ОбъектРемонта.ТиповойОР;
		
		СписокТиповых = Новый Массив;
		Если ЗначениеЗаполнено(ТиповойОР) Тогда
			СписокТиповых.Добавить(ТиповойОР);
		КонецЕсли;
		
		ТаблицаРодителейТиповых = торо_ОбщегоНазначения.ПолучитьТаблицуРодителейСпискаОбъектов(СписокТиповых, Тип("СправочникСсылка.торо_ТиповыеОР"), Истина);
		ТаблицаРодителейТиповых.Колонки.Добавить("ОбъектРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
		ТаблицаРодителейТиповых.ЗаполнитьЗначения(ОбъектРемонта, "ОбъектРемонта");
		
		МассивПоказателей = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(ОбъектРемонта,,Истина,,ТаблицаРодителейТиповых);
		
		Для каждого текЭл из МассивПоказателей Цикл
			масВыбора.Добавить(текЭл.Показатель);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат масВыбора;
	
КонецФункции

&НаСервереБезКонтекста
Функция УстановитьСписокПараметровНаработкиДляВыбора(ОбъектРемонта)
	
	масВозврата = Новый Массив;
	Если ЗначениеЗаполнено(ОбъектРемонта) Тогда
		
		масПоказателей = торо_РаботаСНаработкой.ОбновитьНаработку(ОбъектРемонта, ОбъектРемонта.ТиповойОР);
		
		Для каждого текЭл из масПоказателей Цикл
			масВозврата.Добавить(текЭл.Показатель);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат масВозврата;
	
КонецФункции

&НаСервереБезКонтекста
функция УстановитьСписокТиповыхДефектовДляВыбора(ОбъектРемонта);
	
	масВозврата = новый Массив;
	Если ЗначениеЗаполнено(ОбъектРемонта) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ТиповыеДефектыОборудования.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.торо_ТиповыеДефектыОборудования КАК торо_ТиповыеДефектыОборудования
		               |ГДЕ
		               |	торо_ТиповыеДефектыОборудования.Владелец = &Направление";
		
		Запрос.УстановитьПараметр("Направление", 
			?(ЗначениеЗаполнено(ОбъектРемонта.Направление), ОбъектРемонта.Направление, Справочники.торо_НаправленияОбъектовРемонтныхРабот.БезНаправления));
			
		РезЗапроса = Запрос.Выполнить();
		Если НЕ РезЗапроса.Пустой() Тогда
			Выборка = РезЗапроса.Выгрузить();
			масВозврата = Выборка.ВыгрузитьКолонку("Ссылка");
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат масВозврата;
	
КонецФункции
#КонецОбласти
